const menuConfig = {
  영업 : {
    "주문서" : {
      "거래업체 주문서 조회" : '#' ,
      "주문서 등록" : '#'
    },
    "발주서" :{
    "협력 업체 발주서 조회" : '#',
    "발주서 등록" : '#'
    },
    "거래처" :{
      "거래처 조회" : '#',
      "거래처 등록" : '#'
    },
    "완제품 입고" :{
      "완제품 조회":'#',
      "완제품 등록":'#'
    },
    "반제품 입고" :{
      "반제품 조회":'#',
      "반제품 등록":'#'
    },
    "반품입고":{
      "반품조회":'#',
      "반품등록":'#',
      "폐기 확인서 등록":'#'
    }
  },
  생산 : {
    "공정관리":{
      "공정진행":'#',
      "공정이력조회": '#'
    },
    "품질관리":{
      "품질검사조회":'#',
      "불량관리":'#'
    },
    "설비관리":{
      "설비 현황":'#'
    },
    "생산계획":{
      "조회":'#',
      "작성":'#'
    },
    "생산지시":{
      "조회":'#',
      "작성":'#'
    }
  },
  자재 :{
    "자재재고":{
      "조회":'#',
      "LOT조회":'#',
      "자재발주":'#'
    },

    "자재 입∙출고" :{
      "조회∙등록":'#'
    }
  },
  관리 : {
    "사원":{
      "사원목록":'#'
    },
    "품목" : {
      "품목 목록":'#'
    },
    "설비":{
      "설비 목록": '#'
    },
    "공정":{
      "공정 목록":'#'
    },
    "불량":{
      "불량 목록":'#'
    },
    "BOM":{
      "BOM 목록": '#'
    }

  }

}
module.exports = {
  menuConfig
};